Roland665/MiniCar_Guet/MiniCar_V2.0/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129DNCPDT.svd
        <register>
          <name>RXINTWDT</name>
          <description>Ethernet MAC Receive Interrupt Watchdog Timer</description>
          <addressOffset>0x00000C24</addressOffset>
          <fields>
            <field>
              <name>EMAC_RXINTWDT_RIWT</name>
              <description>Receive Interrupt Watchdog Timer Count</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXDESC</name>
          <description>Ethernet MAC Current Host Transmit Descriptor</description>
          <addressOffset>0x00000C48</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSTXDESC_CURTXDESC</name>
              <description>Host Transmit Descriptor Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXDESC</name>
          <description>Ethernet MAC Current Host Receive Descriptor</description>
          <addressOffset>0x00000C4C</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSRXDESC_CURRXDESC</name>
              <description>Host Receive Descriptor Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTXBA</name>
          <description>Ethernet MAC Current Host Transmit Buffer Address</description>
          <addressOffset>0x00000C50</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSTXBA_CURTXBUFA</name>
              <description>Host Transmit Buffer Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HOSRXBA</name>
          <description>Ethernet MAC Current Host Receive Buffer Address</description>
          <addressOffset>0x00000C54</addressOffset>
          <fields>
            <field>
              <name>EMAC_HOSRXBA_CURRXBUFA</name>
              <description>Host Receive Buffer Address Pointer</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>Ethernet MAC Peripheral Property Register</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>EMAC_PP_PHYTYPE</name>
              <description>Ethernet PHY Type</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_NONE</name>
                  <description>No PHY</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EMAC_PP_PHYTYPE_1</name>
                  <description>Snowflake class PHY</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAC_PP_MACTYPE</name>
              <description>Ethernet MAC Type</description>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>Ethernet MAC Peripheral Configuration Register</description>
          <addressOffset>0x00000FC4</addressOffset>
        </register>
        <register>
          <name>CC</name>
          <description>Ethernet MAC Clock Configuration Register</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>EMAC_CC_CLKEN</name>
              <description>EN0RREF_CLK Signal Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EMAC_CC_PTPCEN</name>
              <description>PTP Clock Reference Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSEXC</name>
      <description>Register map for SYSEXC peripheral</description>
      <groupName>SYSEXC</groupName>
      <prependToName>SYSEXC</prependToName>
      <baseAddress>0x400F9000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>SYSEXC</name><value>67</value></interrupt>
      <registers>
        <register>
          <name>RIS</name>
          <description>System Exception Raw Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_RIS_FPIDCRIS</name>
              <description>Floating-Point Input Denormal Exception Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPDZCRIS</name>
              <description>Floating-Point Divide By 0 Exception Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIOCRIS</name>
              <description>Floating-Point Invalid Operation Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPUFCRIS</name>
              <description>Floating-Point Underflow Exception Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPOFCRIS</name>
              <description>Floating-Point Overflow Exception Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_RIS_FPIXCRIS</name>
              <description>Floating-Point Inexact Exception Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>System Exception Interrupt Mask</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_IM_FPIDCIM</name>
              <description>Floating-Point Input Denormal Exception Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPDZCIM</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIOCIM</name>
              <description>Floating-Point Invalid Operation Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPUFCIM</name>
              <description>Floating-Point Underflow Exception Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPOFCIM</name>
              <description>Floating-Point Overflow Exception Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_IM_FPIXCIM</name>
              <description>Floating-Point Inexact Exception Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>System Exception Masked Interrupt Status</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SYSEXC_MIS_FPIDCMIS</name>
              <description>Floating-Point Input Denormal Exception Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPDZCMIS</name>
              <description>Floating-Point Divide By 0 Exception Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIOCMIS</name>
              <description>Floating-Point Invalid Operation Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPUFCMIS</name>
              <description>Floating-Point Underflow Exception Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPOFCMIS</name>
              <description>Floating-Point Overflow Exception Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SYSEXC_MIS_FPIXCMIS</name>
              <description>Floating-Point Inexact Exception Masked Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>System Exception Interrupt Clear</description>
          <addressOffset>0x0000000C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSEXC_IC_FPIDCIC</name>
              <description>Floating-Point Input Denormal Exception Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPDZCIC</name>
              <description>Floating-Point Divide By 0 Exception Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIOCIC</name>
              <description>Floating-Point Invalid Operation Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPUFCIC</name>
              <description>Floating-Point Underflow Exception Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPOFCIC</name>
              <description>Floating-Point Overflow Exception Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SYSEXC_IC_FPIXCIC</name>
              <description>Floating-Point Inexact Exception Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
